# -*- coding: utf-8 -*-
'''
Story Config
============
'''

ASSET = {
        "PERSONS": (
            # (tag / name / full / age (birth) / job / call / info)
            ('maki', '真希', '灰村,真希', 17,(1,1), 'female', '学生', 'me:私'),
            ('sakai', '堺田', '堺田,良樹', 40,(1,1), 'male', '元作曲家', 'me:僕'),
            ('mam', '真希の母', '', 37,(1,1), 'female', 'パート',),
            ('dad', '茂男', '灰村,茂男', 45,(1,1), 'male', '場末のピアニスト', 'me:俺'),
            ('yayoi', '弥生', '浜野,弥生', 57,(9,10), 'female', '飲み屋店主', 'me:あたし'),
            ('soda', '想田', '', 30,(1,1), 'male', 'バイト'),
            ("police", '警官', '', 30,(1,1), 'male', '警察官'),
            ),
        "STAGES": (
            # (tag / name / parent / (geometry) / info)
            ('sakaihome', '堺田の家', 'Tokyo'),
            ),
        "DAYS": (
            # (tag / name / month / day / year)
            ),
        "TIMES": (
            # (tag / name / hour / minute)
            ),
        "ITEMS": (
            # (tag / name / cate / info)
            ),
        "WORDS": (
            # (tag / name / cate / info)
            ),
        "RUBIS": (
            # (origin / rubi / exclusions / always)
            ("奏で", "奏《かな》で"),
            ("気怠", "気怠《けだる》"),
            ("逞しい", "逞《たくま》しい"),
            ("諦め", "諦《あきら》め"),
            ("零([さしすせそ])", "零《こぼ》\\1"),
            ("掃([かきくけこ])", "掃《は》\\1"),
            ("惚れ", "惚《ほ》れ"),
            ("竦め", "竦《すく》め"),
            ("覆([あいうえおっ])", "覆《おお》\\1"),
            ("痒い", "痒《かゆ》い"),
            ("傾げ", "傾《かし》げ"),
            ("縋([らりるれろっ])", "縋《すが》\\1"),
            ("拭([あいうえおっ])", "拭《ぬぐ》\\1"),
            # noun
            ("響板", "響板《きょうばん》"),
            ("雫", "雫《しずく》"),
            ("臀部", "臀部《でんぶ》"),
            ("箒", "箒《ほうき》"),
            ("埃", "埃《ほこり》"),
            ("悪戯", "悪戯《いたずら》"),
            ("所為", "所為《せい》"),
            ("唾([がはをに])", "唾《つば》\\1"),
            ("袖([がはをに])", "袖《そで》\\1"),
            ("蓋", "蓋《ふた》"),
            # name
            ("真希", "真希《まき》"),
            ("堺田", "堺田《さかいだ》"),
            ("弥生", "弥生《やよい》"),
            ),
        }

